import numpy as np
import librosa
import soundfile as sf
from audiolazy import lpc

bat_dau = 95*16
ket_thuc = bat_dau + 400
data, fs = sf.read('mix_03.wav', dtype='int16')
x = data[bat_dau:ket_thuc]
# Chuẩn hóa giữa -1 và 1
x = x.astype(np.float32)
x = x / 32768

# pre-emphasis
N = len(x)
y = np.zeros((N,), np.float32)
a = 0.9
for n in range(0, N):
    if n == 0:
        y[n] = x[n] - a*x[n]
    else:
        y[n] = x[n] - a*x[n-1]
        
# Tạo cửa sổ Hamming
w = np.zeros((N,), np.float32)
for n in range(0, N):
    w[n] = 0.54 - 0.46*np.cos(2*np.pi*n/N)
    
# Nhân với cửa sổ Hamming
z = y*w
 
# Tính 13 giá trị tự tương quan
R = librosa.autocorrelate(z, max_size=13)
A = np.zeros((2,12), dtype=np.float32)
A[0, 0], A[0, 1], A[0, 2], A[0, 3], A[0, 4], A[0, 5], A[0, 6], A[0, 7], A[0, 8], A[0, 9], A[0, 10], A[0, 11] = \
R[0], R[1], R[2], R[3], R[4], R[5], R[6], R[7], R[8], R[9], R[10], R[11]

A[1, 0], A[1, 1], A[1, 2], A[1, 3], A[1, 4], A[1, 5], A[1, 6], A[1, 7], A[1, 8], A[1, 9], A[1, 10], A[1, 11] = \
R[1], R[0], R[1], R[2], R[3], R[4], R[5], R[6], R[7], R[8], R[9], R[10]

A[2, 0], A[2, 1], A[2, 2], A[2, 3], A[2, 4], A[2, 5], A[2, 6], A[2, 7], A[2, 8], A[2, 9], A[2, 10], A[2, 11] = \
R[2], R[1], R[0], R[1], R[2], R[3], R[4], R[5], R[6], R[7], R[8], R[9]

A[3, 0], A[3, 1], A[3, 2], A[3, 3], A[3, 4], A[3, 5], A[3, 6], A[3, 7], A[3, 8], A[3, 9], A[3, 10], A[3, 11] = \
R[3], R[2], R[1], R[0], R[1], R[2], R[3], R[4], R[5], R[6], R[7], R[8]

A[4, 0], A[4, 1], A[4, 2], A[4, 3], A[4, 4], A[4, 5], A[4, 6], A[4, 7], A[4, 8], A[4, 9], A[4, 10], A[4, 11] = \
R[4], R[3], R[2], R[1], R[0], R[1], R[2], R[3], R[4], R[5], R[6], R[7]

A[5, 0], A[5, 1], A[5, 2], A[5, 3], A[5, 4], A[5, 5], A[5, 6], A[5, 7], A[5, 8], A[5, 9], A[5, 10], A[5, 11] = \
R[5], R[4], R[3], R[2], R[1], R[0], R[1], R[2], R[3], R[4], R[5], R[6]

A[6, 0], A[6, 1], A[6, 2], A[6, 3], A[6, 4], A[6, 5], A[6, 6], A[6, 7], A[6, 8], A[6, 9], A[6, 10], A[6, 11] = \
R[6], R[5], R[4], R[3], R[2], R[1], R[0], R[1], R[2], R[3], R[4], R[5]

A[7, 0], A[7, 1], A[7, 2], A[7, 3], A[7, 4], A[7, 5], A[7, 6], A[7, 7], A[7, 8], A[7, 9], A[7, 10], A[7, 11] = \
R[7], R[6], R[5], R[4], R[3], R[2], R[1], R[0], R[1], R[2], R[3], R[4]

A[8, 0], A[8, 1], A[8, 2], A[8, 3], A[8, 4], A[8, 5], A[8, 6], A[8, 7], A[8, 8], A[8, 9], A[8, 10], A[8, 11] = \
R[8], R[7], R[6], R[5], R[4], R[3], R[2], R[1], R[0], R[1], R[2], R[3]

A[9, 0], A[9, 1], A[9, 2], A[9, 3], A[9, 4], A[9, 5], A[9, 6], A[9, 7], A[9, 8], A[9, 9], A[9, 10], A[9, 11] = \
R[9], R[8], R[7], R[6], R[5], R[4], R[3], R[2], R[1], R[0], R[1], R[2]

A[10, 0], A[10, 1], A[10, 2], A[10, 3], A[10, 4], A[10, 5], A[10, 6], A[10, 7], A[10, 8], A[10, 9], A[10, 10], A[10, 11] = \
R[10], R[9], R[8], R[7], R[6], R[5], R[4], R[3], R[2], R[1], R[0], R[1]

A[11, 0], A[11, 1], A[11, 2], A[11, 3], A[11, 4], A[11, 5], A[11, 6], A[11, 7], A[11, 8], A[11, 9], A[11, 10], A[11, 11] = \
R[11], R[10], R[9], R[8], R[7], R[6], R[5], R[4], R[3], R[2], R[1], R[0]

b = np.zeros((12,1), dtype=np.float32)
b[0][0] = R[1]
b[1][0] = R[2]
b[2][0] = R[3]
b[3][0] = R[4]
b[4][0] = R[5]
b[5][0] = R[6]
b[6][0] = R[7]
b[7][0] = R[8]
b[8][0] = R[9]
b[9][0] = R[10]
b[10][0] = R[11]
b[11][0] = R[12]

A_1 = np.linalg.inv(A)
a = np.matmul(A_1, b)
print(a)

order = 12
coeffs = lpc.autocor(z, order)
print(f"LPC Coefficients: {coeffs.numerator}")
